Revit 2026 API

# ExportPDFSettingsSetOptions Method

---

Sets options for exporting.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public void SetOptions(
	PDFExportOptions options
)
```
```vb
Public Sub SetOptions (
	options As PDFExportOptions
)
```
```cpp
public:
void SetOptions(
	PDFExportOptions^ options
)
```
```fsharp
member SetOptions :
        options : PDFExportOptions -> unit
```

#### Parameters

options PDFExportOptions
     Other options.

| Exception | Condition |
| --- | --- |
| ArgumentNullException | A non-optional argument was null |

#### Reference

ExportPDFSettings Class

Autodesk.Revit.DB Namespace